import { defineConfig } from 'vitepress'

// https://vitepress.dev/reference/site-config
export default defineConfig({
  //base: '/Docs-For-TUW/',
  head: [["link", { rel: "icon", href: "/logo.svg" }]],
  title: "《亡灵战争》文档库",
  description: "A VitePress Site",
  themeConfig: {
      outlineTitle: "文档目录",
      outline: [2, 6],
       // 设置搜索框的样式
      search: {
        provider: "local",
        options: {
          translations: {
            button: {
              buttonText: "搜索文档",
              buttonAriaLabel: "搜索文档",
            },
            modal: {
              noResultsText: "无法找到相关结果",
              resetButtonTitle: "清除查询条件",
              footer: {
                selectText: "选择",
                navigateText: "切换",
              },
            },
          },
        },
      },
    // https://vitepress.dev/reference/default-theme-config
    nav: [
      { text: '主页面', link: '/' },
      { text: '坐标收集', link: '/locations' },
      { text: '游戏崩溃', link: '/crash' },
      { text: 'BGM收集', link: '/bgmlist'},
      { text: '鸣谢列表', link: '/thanks'},
      { text: '参考链接', link: '/link'}
    ],

    sidebar: [
      {
        text: '文档列表',
        items: [
          { text: '下载处', link: '/download' },
          { text: '常见问题解答', link: '/faq' },
          { text: '游戏崩溃', link: '/crash'},
          { text: 'BGM收集', link: '/bgmlist'},
          { text: '鸣谢列表', link: '/thanks'},
          { text: '参考链接', link: '/link'}
        ]
      }
    ],

    socialLinks: [
      { icon: 'github', link: 'https://github.com/vuejs/vitepress' },
      {
        icon: {
          svg: '<svg t="1707312503799" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2929" width="200" height="200"><path d="M512 0c282.768 0 512 229.232 512 512 0 282.768-229.232 512-512 512C229.232 1024 0 794.768 0 512 0 229.232 229.232 0 512 0z m5.328 240.064c-96-2.72-173.328 73.44-176 171.344v54.4S272 637.12 272 658.88c0 35.36 10.672 35.36 21.328 24.48l45.344-46.24v10.88A169.488 169.488 0 0 0 384 737.776c-21.328 10.88-56 24.48-56 46.224h368c0-24.48-34.672-35.36-58.672-46.24 26.672-21.76 42.672-54.4 45.344-89.744v-13.6s10.656 13.6 45.328 46.24c13.328 13.6 24 13.6 24-21.76 0-20.976-64.48-181.04-69.072-192.448l-0.256-0.64v-57.12C680 316.208 608 242.784 517.328 240.064z" p-id="2930"></path></svg>'
        },
        link: 'https://jq.qq.com/?_wv=1027&k=nA6kszKf'
      },
      {
        icon: {
          svg: '<svg t="1707312596151" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5793" width="200" height="200"><path d="M977.2 208.2c33.4 36.2 48.8 79.4 46.6 131.4v404.8c-0.8 52.8-18.4 96.2-53 130.2-34.4 34-78.2 51.8-131 53.4H184.04c-52.9-1.6-96.42-19.6-130.56-54.4C19.364 838.8 1.534 793 0 736.4V339.6c1.534-52 19.364-95.2 53.48-131.4C87.62 175.5 131.14 157.54 184.04 156h58.76L192.1 104.38c-11.5-11.46-17.26-26-17.26-43.58 0-17.6 5.76-32.12 17.26-43.594C203.6 5.736 218.2 0 235.8 0s32.2 5.736 43.8 17.206L426.2 156h176l149-138.794C763.4 5.736 778.4 0 796 0c17.6 0 32.2 5.736 43.8 17.206 11.4 11.474 17.2 25.994 17.2 43.594 0 17.58-5.8 32.12-17.2 43.58L789.2 156h58.6c52.8 1.54 96 19.5 129.4 52.2z m-77.6 139.4c-0.8-19.2-7.4-34.8-21.4-47-10.4-12.2-28-18.8-45.4-19.6H192.1c-19.18 0.8-34.9 7.4-47.16 19.6-12.28 12.2-18.8 27.8-19.56 47v388.8c0 18.4 6.52 34 19.56 47s28.76 19.6 47.16 19.6H832.8c18.4 0 34-6.6 46.6-19.6 12.6-13 19.4-28.6 20.2-47V347.6z m-528.6 85.4c12.6 12.6 19.4 28.2 20.2 46.4V546c-0.8 18.4-7.4 33.8-19.6 46.4-12.4 12.6-28 19-47.2 19-19.2 0-35-6.4-47.2-19-12.2-12.6-18.8-28-19.6-46.4v-66.6c0.8-18.2 7.6-33.8 20.2-46.4 12.6-12.6 26.4-19.2 46.6-20 18.4 0.8 34 7.4 46.6 20z m383 0c12.6 12.6 19.4 28.2 20.2 46.4V546c-0.8 18.4-7.4 33.8-19.6 46.4-12.2 12.6-28 19-47.2 19-19.2 0-34.8-6.4-47.2-19-14-12.6-18.8-28-19.4-46.4v-66.6c0.6-18.2 7.4-33.8 20-46.4 12.6-12.6 28.2-19.2 46.6-20 18.4 0.8 34 7.4 46.6 20z" p-id="5794"></path></svg>'
        },
        link: 'https://space.bilibili.com/40074868'
      }
    ],

    footer: 
      { copyright: "UEL Creators | TUW Group | Site Design By D_B_dev" }
  }
})
